#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_team.teams["distribution"]: Refreshing state... [id=6847101]
github_team.teams["content"]: Refreshing state... [id=6847102]
github_team.teams["continuous-integration"]: Refreshing state... [id=6847099]
github_team.teams["tech-lead"]: Refreshing state... [id=6847098]
github_team.teams["infrastructure"]: Refreshing state... [id=6847100]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.repositories["terraform"]: Refreshing state... [id=terraform]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_membership.users["wigman"]: Refreshing state... [id=Mage-OS:wigman]
github_membership.users["damienwebdev"]: Refreshing state... [id=Mage-OS:damienwebdev]
github_membership.users["Vinai"]: Refreshing state... [id=Mage-OS:Vinai]
github_membership.users["mage-os-ci"]: Refreshing state... [id=Mage-OS:mage-os-ci]
github_membership.users["johnhughes1984"]: Refreshing state... [id=Mage-OS:johnhughes1984]
github_membership.users["sprankhub"]: Refreshing state... [id=Mage-OS:sprankhub]
github_team_membership.members["mage-os-ci_continuous-integration"]: Refreshing state... [id=6847099:mage-os-ci]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDOIIQUpM4By-eH]
github_team_membership.members["johnhughes1984_content"]: Refreshing state... [id=6847102:johnhughes1984]
github_team_membership.members["Vinai_content"]: Refreshing state... [id=6847102:Vinai]
github_team_membership.members["damienwebdev_infrastructure"]: Refreshing state... [id=6847100:damienwebdev]
github_team_membership.members["wigman_content"]: Refreshing state... [id=6847102:wigman]
github_team_membership.members["sprankhub_distribution"]: Refreshing state... [id=6847101:sprankhub]
github_team_membership.members["sprankhub_infrastructure"]: Refreshing state... [id=6847100:sprankhub]
github_team_membership.members["Vinai_distribution"]: Refreshing state... [id=6847101:Vinai]
github_team_membership.members["Vinai_infrastructure"]: Refreshing state... [id=6847100:Vinai]
github_team_membership.members["Vinai_tech-lead"]: Refreshing state... [id=6847098:Vinai]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOGMKAG84By-dP]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOGMKCJ84By-dW]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDOGMKFF84By-dc]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDOGMKC6M4By-d2]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDOG3Rr984By-dH]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDOG8FV-s4By-dL]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDOHynKTc4By-d9]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDOGHBHCc4By-d4]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOG8FefM4By-dZ]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOG1y6y84By-df]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOG3Ro_84By-dJ]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDOGMKCY84By-d1]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOG1y7C84By-d5]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDOGwaLE84By-dS]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDOGMKBz84By-dN]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOG8L6gs4By-eB]
github_repository_file.codeowners["terraform"]: Refreshing state... [id=terraform/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mage-os-website"]: Refreshing state... [id=mage-os-website/CODEOWNERS]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=6847102:mage-os-website]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=6847100:namespace]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=6847101:mageos-magento2]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=6847100:infrastructure]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=6847098:mageos-magento2]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=6847098:mage-os-website]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=6847098:infrastructure]
github_team_repository.tech-lead["terraform"]: Refreshing state... [id=6847098:terraform]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=6847098:namespace]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDOH66Nbs4BysK-]
github_branch_protection.repositories["terraform"]: Refreshing state... [id=BPR_kwDOHNQe7c4BysLD]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDOGIl6i84BysLC]
github_branch_protection.repositories["mage-os-website"]: Refreshing state... [id=BPR_kwDOGCTTT84BysLE]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDOGHBGY84BysK_]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_membership.users["Vinai"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"49380be251d9a6fe0059d027b10a897fb2cb95f7150f0615e5449ec2d007081b\"" -> "W/\"5686ac966478e9f726eba29483eb57ddeee2ec996b1c68a64bb0d636eb183f42\""
        id       = "Mage-OS:Vinai"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["damienwebdev"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"9feda8caed9c0cfd0aea35a05cc5d9acad50716cedd5f7073e3fdbb15e7fe0d5\"" -> "W/\"855d3cc967665985ae27fc086a1dab21b62bebc4e3e8933e8cf52351e377aedb\""
        id       = "Mage-OS:damienwebdev"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["johnhughes1984"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"dddd2703f0f385f65b6f328af4f2b6391eb79efe09f5f30976d7da74851fdd7a\"" -> "W/\"843141aee1a1435ac7734992c78b1092123f0faf619bcd544d3ee1310e4f1dac\""
        id       = "Mage-OS:johnhughes1984"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["mage-os-ci"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"360bd6528fc935df728e423fd68e951ec57989c406d67c182655312ac12a6f91\"" -> "W/\"124639ec477042dfbf1d76d9d09795f47d2fb2ff93ada1469c54ad0ca47c1472\""
        id       = "Mage-OS:mage-os-ci"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["sprankhub"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"c48aef59ec6ed4767d8bbaef63b688ff92353371fe4ceea88bf32ee3a161429e\"" -> "W/\"a68cd267ee39dcb94a330902d70df3a4e483239646739a58acb67210de783bf9\""
        id       = "Mage-OS:sprankhub"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["wigman"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"ae1cbfb49b0727ca17fa8211b48a49e5fd2a1dfe1ae2f150ab73efb51319fa5a\"" -> "W/\"84bf3f03ca7d19686d69c00605a42f91a087e3c04b28b4e8f09c9dafea6cd3b4\""
        id       = "Mage-OS:wigman"
        # (2 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-magento2"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ branches               = [
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
          ~ {
              ~ name      = "lenaorobei-patch-1" -> "ihor-sviziev-patch-1"
              ~ protected = false -> true
            },
        ]
      ~ etag                   = "W/\"393c6bd0076d1320b76c01344bb30647f9351f52561f9aefb4cc856145585953\"" -> "W/\"20a82ce3777110a6946c63c510bc05d960120f5b138dcd68ec393a9f24b4f8b2\""
        id                     = "mirror-magento2"
        name                   = "mirror-magento2"
        # (26 unchanged attributes hidden)
    }

  # github_repository.repositories["mage-os-website"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                   = "W/\"39626010f8aaa0ebe1b21e2657ebc43f1436808bdebcea0bf09974a20267d688\"" -> "W/\"94678ba8726917cc800a3a56435025472afc3c1278bb28eb608b0be00e3530d4\""
      + homepage_url           = "mage-os-community.vercel.app"
        id                     = "mage-os-website"
        name                   = "mage-os-website"
        # (27 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento2"] has changed
  ~ resource "github_repository" "repositories" {
      ~ branches               = [
            # (20 unchanged elements hidden)
            {
                name      = "PB-500"
                protected = true
            },
          + {
              + name      = "add_merge_upstream_changes_workflow"
              + protected = true
            },
            {
                name      = "api-changes-develop"
                protected = true
            },
            # (6 unchanged elements hidden)
            {
                name      = "lenaorobei-patch-1"
                protected = true
            },
          - {
              - name      = "lenaorobei-patch-2"
              - protected = true
            },
        ]
      ~ etag                   = "W/\"b237bec801d0b62988f3c12d7f73456af19b5b9fb6cdae9a838c27b533ac0139\"" -> "W/\"37b43c524090690e8622eddc11654273baf44d71dc9d7f764eba943ade8b2776\""
        id                     = "mageos-magento2"
        name                   = "mageos-magento2"
        # (26 unchanged attributes hidden)
    }

  # github_team.teams["content"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"74c138ad5b2034d968619e1e2f97c9419dfefcf44422937d394d8da798f1138a\"" -> "W/\"1022f956945b5301ffde3b292b401d16be6946abe7ba3413f0db814d1c408c86\""
        id                        = "6847102"
        name                      = "content"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["continuous-integration"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"0ea4208bdd0dfade8238ff84e130b66fbae86f8f7bfbd0e44340986685afd1b5\"" -> "W/\"874ac165b847d1ad6d1fbf9b6152e721d01bd69b204d4d7d999a8c7622c90034\""
        id                        = "6847099"
        name                      = "continuous-integration"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["distribution"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"07676e6fe67fe0adfbe7500a5fdf302cfef3bbd4dd3865133613a09ac0c7d445\"" -> "W/\"31f470142b437c45e88e9336f3ed4de32ffbd2798f18319b4f74abe921ad1acd\""
        id                        = "6847101"
        name                      = "distribution"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["infrastructure"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"43bf2004202fbcaab251325ddd3e1fa1f7812770e78abf2dea70c7afe58f2d7d\"" -> "W/\"41f6be0f7992c0a09f1566e8c51f8de925f78734e85d2ffaaf613368ab7c6955\""
        id                        = "6847100"
        name                      = "infrastructure"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["tech-lead"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"eba293d8e953f105a5b7e33110a2248b7b85aff60fdf139748663678ad009c07\"" -> "W/\"4309d9d6334b504702ef04dac6a9bb4f0778e6ca9106c04053d57a10e2671f85\""
        id                        = "6847098"
        name                      = "tech-lead"
        # (6 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"b50f54ee6d193ca31262161092749a4484ae436ca59eac66f6365221e630b16a\"" -> "W/\"67248bd61fdc2f98242c48353d19d95e10774dc9a4c00632a68f60ce9d178db5\""
        id       = "6847102:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"a3a36a5932418e6f30c6185c88f75c736b1c228bba7ee9a8efb7bf537951fd83\"" -> "W/\"7afe85c4a7f4633df59e4272ae2c73b39f3736420b6f362f5ff76a657cbf028b\""
        id       = "6847101:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"c1c7e50b590410aad9f7af3eae1b0d6884c0850d00c8f829072137156b41e8ec\"" -> "W/\"c50d1371930b1bad94ba3b10fa046be60d520aafb62a5e816cddcbaae14e6c97\""
        id       = "6847100:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_tech-lead"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"ab8c1963aecc08931504b32810aedf910a050433458ad438a57ad94a04c83c43\"" -> "W/\"18f0f37c868faeb4e442ffd717d4f9cfe03339a372a91d0cf01b00a682c7771b\""
        id       = "6847098:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"7725f9facf6bd2e0930ce532f897b8655d707764730ea22f0e0fd461826037d0\"" -> "W/\"43925b05a96cc2dae5ad3a16277a15194d3c8a76971223ffe438bfcf69de4157\""
        id       = "6847100:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["johnhughes1984_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"caf7e5d2536dd9b833a495b49a1df8fe0c459c26e2a7cc3d5713e78255c80d9a\"" -> "W/\"9334b081af8a020082a81df8388aebcff659de2128df00ad377e163d08613fef\""
        id       = "6847102:johnhughes1984"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["mage-os-ci_continuous-integration"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"d43a83441cf23f30c59928ed3978410d5534c36acf4e16c47e7ca84717db798f\"" -> "W/\"fea005a95a2e9176f5314c14775267e94338e45ae27aae39c3d0832031af755f\""
        id       = "6847099:mage-os-ci"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"207f7be6f2c52f3e2c71ad95fc57100a1750d28de1f486f58a5f37c9784513ce\"" -> "W/\"bc72267ba22dec4e434348da3b250b8d6be647a76df4885c2b7b7d54685b7725\""
        id       = "6847101:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"db8aa59a93f015797d91a3aa36c51a637362fe98dbd24e3759a0744df1c0b362\"" -> "W/\"d022f23751297d23a9c2ec0b56db70866c2c53e0b878e08609c648f9afef35b7\""
        id       = "6847100:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["wigman_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"c7cc6c515d724ef29093e789d015bb930909e71d207790945c10fc328c3c9fe5\"" -> "W/\"404c3392dbe3551275ea29adf9f14decb5289b3230058f8a864bd5c561c45a09\""
        id       = "6847102:wigman"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["infrastructure_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"cd00cfd3c1c8f8a38e59ffe4725fae15af6577a5528c747dc5218fe6a3f8a591\"" -> "W/\"851912799496af3d6c507296f6d43b90ae57982c5bb5aca482fc685067d226a7\""
        id         = "6847100:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mage-os-website_content"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"f9207170395e9530279ef2daf5db7aec28dc621daded55815f948ce8b403c88f\"" -> "W/\"78eb4b01474cb6f2821021fd9ceb0be19e580956f21c959b0d781b70cb0948db\""
        id         = "6847102:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"5ef96fb54cfac91f9b7cf44b5c7740edf29c22203f741c86dcdc5f68b2543615\"" -> "W/\"fd0f0780006be29f2d4952b9d863850d75f35bc11e871bf3f168b1280cf6d057\""
        id         = "6847101:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["namespace_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"95131b0d47700d71e392e5c6475b1ea4a919f04a1a6d23ac5dc3507fdc9e49cf\"" -> "W/\"761fed02b6220962ebd772e3b1b01c48f793219318021f1671effeb6e3b3ecee\""
        id         = "6847100:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["infrastructure"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"67a4fcb91800b95b760ac0273997ff99e7a392b3129b31e675deddd6340f19ac\"" -> "W/\"12b81bcd855d691de73ccd4948ae676c6c9c19135394a2a465d9e632a5c67f39\""
        id         = "6847098:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mage-os-website"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"708c0331fb8849b491dc265eac09c735bf285802b6a250bc2cb139d210c13e01\"" -> "W/\"2411bcbd720c2b820e9df659242ebf1a57015188787357b783de91347ad80a2e\""
        id         = "6847098:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"394853487e39e790c980ebdd354f7af96b96c99219a1bee31b8b366765ae45cc\"" -> "W/\"12815b85f7cb661497465f6f96f1a3417ced26e4eee8fcaee1260c176e930c1e\""
        id         = "6847098:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["namespace"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"9a26f4c99a13591a1919b078dedf0b0b19e5eca2bb580fa65a698ef7975a757e\"" -> "W/\"3024615225f1229e4a13eb700a303c088ae025b9d9c7b296df105e65d52609ef\""
        id         = "6847098:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["terraform"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"e8e07c5b276f4e56e3825fba58b57e8f46fe81062f5697d1e10aab1854b7ce50\"" -> "W/\"729d8663b78a1feb1bb2f212f3934f50939256cba90468796565917a9759afb9\""
        id         = "6847098:terraform"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.repositories["mageos-adobe-stock-integration"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOISiZ3A"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-commerce-data-export"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOISixHw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOISiqVw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-composer-root-update-plugin"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOISimRQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-inventory"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOIShsYA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-inventory-composer-installer"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOISiM0w"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-magento-composer-installer"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOISihVw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-magento2-page-builder"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOISiVZQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-magento2-sample-data"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOISivQQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["mageos-security-package"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "R_kgDOIShpTA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 2
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.repositories["mage-os-website"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      - homepage_url           = "mage-os-community.vercel.app" -> null
        id                     = "mage-os-website"
        name                   = "mage-os-website"
        # (28 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-adobe-stock-integration"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "About This is a Mage-OS fork of the Magento Adobe Stock Integration Project found at https://github.com/magento/adobe-stock-integration" -> "This is a Mage-OS fork of the Magento Adobe Stock Integration Project found at https://github.com/magento/adobe-stock-integration."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
        id                     = "mageos-adobe-stock-integration"
        name                   = "mageos-adobe-stock-integration"
        # (24 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-commerce-data-export"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "This is a Mage-OS fork of the Magento Commerce Data Export Project found at https://github.com/magento/commerce-data-export" -> "This is a Mage-OS fork of the Magento Commerce Data Export Project found at https://github.com/magento/commerce-data-export."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
        id                     = "mageos-commerce-data-export"
        name                   = "mageos-commerce-data-export"
        # (24 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-composer-dependency-version-audit-plugin"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "This is a Mage-OS fork of the validating Magento packages through a composer plugin Project found at https://github.com/magento/composer-dependency-version-audit-plugin" -> "This is a Mage-OS fork of the validating Magento packages through a composer plugin Project found at https://github.com/magento/composer-dependency-version-audit-plugin."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
      ~ has_wiki               = true -> false
        id                     = "mageos-composer-dependency-version-audit-plugin"
        name                   = "mageos-composer-dependency-version-audit-plugin"
        # (23 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-composer-root-update-plugin"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "About This is a Mage-OS fork of the Magento Composer Root Update Plugin found at https://github.com/magento/composer-root-update-plugin" -> "This is a Mage-OS fork of the Magento Composer Root Update Plugin found at https://github.com/magento/composer-root-update-plugin."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
        id                     = "mageos-composer-root-update-plugin"
        name                   = "mageos-composer-root-update-plugin"
        # (24 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-inventory"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "This is a Mage-OS fork of the Magento Inventory Project (a.k.a MSI) found at https://github.com/magento/inventory" -> "This is a Mage-OS fork of the Magento Inventory Project (a.k.a MSI) found at https://github.com/magento/inventory."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
        id                     = "mageos-inventory"
        name                   = "mageos-inventory"
        # (24 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-inventory-composer-installer"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "This is a Mage-OS fork of the Inventory Composer Installer Project found at https://github.com/magento/inventory-composer-installer" -> "This is a Mage-OS fork of the Inventory Composer Installer Project found at https://github.com/magento/inventory-composer-installer."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
        id                     = "mageos-inventory-composer-installer"
        name                   = "mageos-inventory-composer-installer"
        # (24 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento-composer-installer"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "This is a Mage-OS fork of the Magento Composer Installer Project found at https://github.com/magento/magento-composer-installer" -> "This is a Mage-OS fork of the Magento Composer Installer Project found at https://github.com/magento/magento-composer-installer."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
        id                     = "mageos-magento-composer-installer"
        name                   = "mageos-magento-composer-installer"
        # (24 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento2-page-builder"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "This is a Mage-OS fork of the Magento2 PageBuilder Project found at https://github.com/magento/magento2-page-builder" -> "This is a Mage-OS fork of the Magento2 PageBuilder Project found at https://github.com/magento/magento2-page-builder."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
        id                     = "mageos-magento2-page-builder"
        name                   = "mageos-magento2-page-builder"
        # (24 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento2-sample-data"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "This is a Mage-OS fork of the Magento 2 Sample Data Project found at https://github.com/magento/magento2-sample-data" -> "This is a Mage-OS fork of the Magento 2 Sample Data Project found at https://github.com/magento/magento2-sample-data."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
        id                     = "mageos-magento2-sample-data"
        name                   = "mageos-magento2-sample-data"
        # (24 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-security-package"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ auto_init              = false -> true
      ~ description            = "This is a Mage-OS fork of the Magento Security Extensions project found at https://github.com/magento/security-package" -> "This is a Mage-OS fork of the Magento Security Extensions project found at https://github.com/magento/security-package."
      - has_downloads          = true -> null
      ~ has_issues             = false -> true
        id                     = "mageos-security-package"
        name                   = "mageos-security-package"
        # (24 unchanged attributes hidden)
    }

  # github_repository_file.codeowners["mageos-adobe-stock-integration"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "develop"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-adobe-stock-integration"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-commerce-data-export"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-commerce-data-export"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "main"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-composer-dependency-version-audit-plugin"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-composer-root-update-plugin"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "develop"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-composer-root-update-plugin"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-inventory"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "develop"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-inventory"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-inventory-composer-installer"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "master"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-inventory-composer-installer"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-magento-composer-installer"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "master"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-magento-composer-installer"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-magento2-page-builder"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "develop"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-magento2-page-builder"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-magento2-sample-data"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "2.4-develop"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-magento2-sample-data"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mageos-security-package"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = "develop"
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-security-package"
      + sha                 = (known after apply)
    }

  # github_team_repository.teams["mageos-adobe-stock-integration_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-adobe-stock-integration"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mageos-commerce-data-export_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-commerce-data-export"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-composer-dependency-version-audit-plugin"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mageos-composer-root-update-plugin_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-composer-root-update-plugin"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mageos-inventory-composer-installer_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-inventory-composer-installer"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mageos-inventory_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-inventory"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mageos-magento-composer-installer_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-magento-composer-installer"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mageos-magento2-page-builder_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-magento2-page-builder"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mageos-magento2-sample-data_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-magento2-sample-data"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["mageos-security-package_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-security-package"
      + team_id    = "distribution"
    }

  # github_team_repository.tech-lead["mageos-adobe-stock-integration"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-adobe-stock-integration"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["mageos-commerce-data-export"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-commerce-data-export"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-composer-dependency-version-audit-plugin"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["mageos-composer-root-update-plugin"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-composer-root-update-plugin"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["mageos-inventory"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-inventory"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["mageos-inventory-composer-installer"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-inventory-composer-installer"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["mageos-magento-composer-installer"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-magento-composer-installer"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["mageos-magento2-page-builder"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-magento2-page-builder"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["mageos-magento2-sample-data"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-magento2-sample-data"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["mageos-security-package"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-security-package"
      + team_id    = "6847098"
    }

Plan: 40 to add, 11 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Issuer: @sprankhub, Action: https://github.com/mage-os/terraform/actions/runs/3352869861